### Terraform Plan for Test 🔍

<details>
<summary>Show Plan</summary>

```terraform
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app.module.preview_url[0].aws_ssm_parameter.central_deployment_account_id will be updated in-place
  ~ resource "aws_ssm_parameter" "central_deployment_account_id" {
        id              = "/__deployment__/applications/preview-url-mapper/central-deployment-account-id"
        name            = "/__deployment__/applications/preview-url-mapper/central-deployment-account-id"
      ~ tags            = {
          - "application" = "digitalekanaler-admin" -> null
          - "repo"        = "digitalekanaler-admin-frontend" -> null
        }
      ~ tags_all        = {
          ~ "application" = "digitalekanaler-admin" -> "digitalekanaler-designmanual"
          ~ "repo"        = "digitalekanaler-admin-frontend" -> "spor"
            # (1 unchanged element hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.aws_ecs_service.service[0] will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:eu-west-1:590183702222:service/common-services-spot-cluster/digitalekanaler-designmanual"
        name                               = "digitalekanaler-designmanual"
        tags                               = {}
      ~ wait_for_steady_state              = false -> true
        # (19 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.app.module.ssr_task.aws_ecs_task_definition.task[0] must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:590183702222:task-definition/digitalekanaler-designmanual:120" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:590183702222:task-definition/digitalekanaler-designmanual" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image            = "637423315721.dkr.ecr.eu-west-1.amazonaws.com/designmanual:12683e1bd9d9fe2fa03433a374ba27096583bd38" -> "637423315721.dkr.ecr.eu-west-1.amazonaws.com/designmanual:ccaa37f9fe3aa191f7b36d82e57873fcb0c391df"
                    name             = "digitalekanaler-designmanual-main"
                    # (8 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "digitalekanaler-designmanual" -> (known after apply)
      ~ revision                 = 120 -> (known after apply)
      - tags                     = {} -> null
        # (13 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.aws_iam_role_policy.task_execution will be updated in-place
  ~ resource "aws_iam_role_policy" "task_execution" {
        id          = "digitalekanaler-designmanual-task-execution-role:digitalekanaler-designmanual-task-execution"
        name        = "digitalekanaler-designmanual-task-execution"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    # (2 unchanged elements hidden)
                    {
                        Action   = "kms:Decrypt"
                        Effect   = "Allow"
                        Resource = "arn:aws:kms:eu-west-1:727646359971:key/1bfdf87f-a69c-41f8-929a-2a491fc64f69"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:eu-west-1:590183702222:parameter/__platform__/versions/digitalekanaler-designmanual"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.aws_ssm_parameter.deployment_version will be destroyed
  # (because aws_ssm_parameter.deployment_version is not in configuration)
  - resource "aws_ssm_parameter" "deployment_version" {
      - arn             = "arn:aws:ssm:eu-west-1:590183702222:parameter/__platform__/versions/digitalekanaler-designmanual" -> null
      - data_type       = "text" -> null
      - id              = "/__platform__/versions/digitalekanaler-designmanual" -> null
      - name            = "/__platform__/versions/digitalekanaler-designmanual" -> null
      - overwrite       = true -> null
      - region          = "eu-west-1" -> null
      - tags            = {} -> null
      - tags_all        = {
          - "application" = "digitalekanaler-designmanual"
          - "repo"        = "spor"
          - "terraform"   = "true"
        } -> null
      - tier            = "Standard" -> null
      - type            = "String" -> null
      - value           = (sensitive value) -> null
      - value_wo        = (write-only attribute) -> null
      - version         = 93 -> null
        # (3 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.aws_ssm_parameter.ssm_parameters["compute_target"] will be destroyed
  # (because key ["compute_target"] is not in for_each map)
  - resource "aws_ssm_parameter" "ssm_parameters" {
      - arn             = "arn:aws:ssm:eu-west-1:590183702222:parameter/__deployment__/applications/digitalekanaler-designmanual/compute_target" -> null
      - data_type       = "text" -> null
      - id              = "/__deployment__/applications/digitalekanaler-designmanual/compute_target" -> null
      - name            = "/__deployment__/applications/digitalekanaler-designmanual/compute_target" -> null
      - region          = "eu-west-1" -> null
      - tags            = {} -> null
      - tags_all        = {
          - "application" = "digitalekanaler-designmanual"
          - "repo"        = "spor"
          - "terraform"   = "true"
        } -> null
      - tier            = "Standard" -> null
      - type            = "String" -> null
      - value           = (sensitive value) -> null
      - value_wo        = (write-only attribute) -> null
      - version         = 1 -> null
        # (3 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.aws_ssm_parameter.ssm_parameters["ecr_image_base"] must be replaced
-/+ resource "aws_ssm_parameter" "ssm_parameters" {
      ~ arn             = "arn:aws:ssm:eu-west-1:590183702222:parameter/__deployment__/applications/digitalekanaler-designmanual/ecr_image_base" -> (known after apply)
      ~ data_type       = "text" -> (known after apply)
      + has_value_wo    = (known after apply)
      ~ id              = "/__deployment__/applications/digitalekanaler-designmanual/ecr_image_base" -> (known after apply)
      + insecure_value  = (known after apply)
      + key_id          = (known after apply)
      ~ name            = "/__deployment__/applications/digitalekanaler-designmanual/ecr_image_base" -> "/__deployment__/spor/apps/designmanual-frontend/ecr_image_base" # forces replacement
      - tags            = {} -> null
      ~ tier            = "Standard" -> (known after apply)
      ~ version         = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.aws_ssm_parameter.ssm_parameters["ecs_cluster_name"] must be replaced
-/+ resource "aws_ssm_parameter" "ssm_parameters" {
      ~ arn             = "arn:aws:ssm:eu-west-1:590183702222:parameter/__deployment__/applications/digitalekanaler-designmanual/ecs_cluster_name" -> (known after apply)
      ~ data_type       = "text" -> (known after apply)
      + has_value_wo    = (known after apply)
      ~ id              = "/__deployment__/applications/digitalekanaler-designmanual/ecs_cluster_name" -> (known after apply)
      + insecure_value  = (known after apply)
      + key_id          = (known after apply)
      ~ name            = "/__deployment__/applications/digitalekanaler-designmanual/ecs_cluster_name" -> "/__deployment__/spor/apps/designmanual-frontend/ecs_cluster_name" # forces replacement
      - tags            = {} -> null
      ~ tier            = "Standard" -> (known after apply)
      ~ version         = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.aws_ssm_parameter.ssm_parameters["ecs_container_name"] must be replaced
-/+ resource "aws_ssm_parameter" "ssm_parameters" {
      ~ arn             = "arn:aws:ssm:eu-west-1:590183702222:parameter/__deployment__/applications/digitalekanaler-designmanual/ecs_container_name" -> (known after apply)
      ~ data_type       = "text" -> (known after apply)
      + has_value_wo    = (known after apply)
      ~ id              = "/__deployment__/applications/digitalekanaler-designmanual/ecs_container_name" -> (known after apply)
      + insecure_value  = (known after apply)
      + key_id          = (known after apply)
      ~ name            = "/__deployment__/applications/digitalekanaler-designmanual/ecs_container_name" -> "/__deployment__/spor/apps/designmanual-frontend/ecs_container_name" # forces replacement
      - tags            = {} -> null
      ~ tier            = "Standard" -> (known after apply)
      ~ version         = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.aws_ssm_parameter.ssm_parameters["ecs_container_port"] must be replaced
-/+ resource "aws_ssm_parameter" "ssm_parameters" {
      ~ arn             = "arn:aws:ssm:eu-west-1:590183702222:parameter/__deployment__/applications/digitalekanaler-designmanual/ecs_container_port" -> (known after apply)
      ~ data_type       = "text" -> (known after apply)
      + has_value_wo    = (known after apply)
      ~ id              = "/__deployment__/applications/digitalekanaler-designmanual/ecs_container_port" -> (known after apply)
      + insecure_value  = (known after apply)
      + key_id          = (known after apply)
      ~ name            = "/__deployment__/applications/digitalekanaler-designmanual/ecs_container_port" -> "/__deployment__/spor/apps/designmanual-frontend/ecs_container_port" # forces replacement
      - tags            = {} -> null
      ~ tier            = "Standard" -> (known after apply)
      ~ version         = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.aws_ssm_parameter.ssm_parameters["ecs_service_name"] must be replaced
-/+ resource "aws_ssm_parameter" "ssm_parameters" {
      ~ arn             = "arn:aws:ssm:eu-west-1:590183702222:parameter/__deployment__/applications/digitalekanaler-designmanual/ecs_service_name" -> (known after apply)
      ~ data_type       = "text" -> (known after apply)
      + has_value_wo    = (known after apply)
      ~ id              = "/__deployment__/applications/digitalekanaler-designmanual/ecs_service_name" -> (known after apply)
      + insecure_value  = (known after apply)
      + key_id          = (known after apply)
      ~ name            = "/__deployment__/applications/digitalekanaler-designmanual/ecs_service_name" -> "/__deployment__/spor/apps/designmanual-frontend/ecs_service_name" # forces replacement
      - tags            = {} -> null
      ~ tier            = "Standard" -> (known after apply)
      ~ version         = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.app.module.ssr_task.terraform_data.datadog_and_instrumentation_runtime will be created
  + resource "terraform_data" "datadog_and_instrumentation_runtime" {
      + id = (known after apply)
    }

Plan: 7 to add, 3 to change, 8 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/app.preview_url/main.tf line 111, in resource "aws_lambda_function" "lambda_function":
 111: resource "aws_lambda_function" "lambda_function" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute qualified_arn is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*For commit c175a280d7e0d8a689fc1609ddc74755c7382ed4*
*Plan generated at: 2025-12-19 08:58:48 UTC*
